
#### Terraform Format and Style 🖌`success`
<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.password: Refreshing state... [id=none]
random_uuid.acadapr: Refreshing state... [id=63bd3ac7-9239-f65b-9812-d58f0b549ef0]
azurerm_resource_group.baseRG: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03N2U1MTFmNi0wNjgyLTQxZDMtYTg0MC03NjU2NTY2YzBjY2E7b2JqZWN0SWQ9MjEwZTI0N2YtYjExNC00MGVkLWEzYjQtNTA0Yjc1NDI3MDg0O3N1YnNjcmlwdGlvbklkPTI2MDg2MjNlLTMyNmUtNDc2NS05NWZjLWI4ZjY1YTVjM2NiMTt0ZW5hbnRJZD1kMTk5MzkwMS1iYjUxLTQ5MmYtOGUwZC01NzJiMTM4NGYzYTY=]
azurerm_container_registry.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.ContainerRegistry/registries/acapokeracr]
azurerm_log_analytics_workspace.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.OperationalInsights/workspaces/acapoker-law]
azurerm_key_vault.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.KeyVault/vaults/acapoker-kv]
azurerm_container_app_environment.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.App/managedEnvironments/acapoker-ace]
azurerm_key_vault_secret.aca-pass: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/aca-pass/c1d3d44a5e3b4ea58697d8a79c077502]
azurerm_key_vault_secret.aca-user: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/aca-user/2dde02ff819540e9ae95ba398d0fa8f7]
azurerm_key_vault_secret.psql-user: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/psql-user/fa1d176e74c3409197160ff32594b18d]
azurerm_key_vault_secret.aca-url: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/aca-url/050017480f834eeda77d92aac753078d]
azurerm_key_vault_secret.psql-pass: Refreshing state... [id=https://acapoker-kv.vault.azure.net/secrets/psql-pass/b44a4d2c934840d1bcda9b66f477dc3b]
azurerm_postgresql_flexible_server.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.DBforPostgreSQL/flexibleServers/acadapr-psql]
azurerm_postgresql_flexible_server_database.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.DBforPostgreSQL/flexibleServers/acadapr-psql/databases/acadapr-db]
azurerm_container_app_environment_dapr_component.acadapr: Refreshing state... [id=/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.App/managedEnvironments/acapoker-ace/daprComponents/acapoker-state]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.acadapr will be created
  + resource "azurerm_container_app" "acadapr" {
      + container_app_environment_id  = "/subscriptions/2608623e-326e-4765-95fc-b8f65a5c3cb1/resourceGroups/acapoker/providers/Microsoft.App/managedEnvironments/acapoker-ace"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "acapoker-aca"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "acapoker"
      + revision_mode                 = "Single"

      + dapr {
          + app_id       = "63bd3ac7-9239-f65b-9812-d58f0b549ef0"
          + app_protocol = "http"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 80
          + transport                  = "auto"

          + traffic_weight {
              + latest_revision = false
              + percentage      = 100
            }
        }

      + template {
          + max_replicas    = 10
          + min_replicas    = (known after apply)
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "mcr.microsoft.com/azuredocs/containerapps-helloworld:latest"
              + memory            = "0.5Gi"
              + name              = "acapoker-container"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Joey40, Action: `pull_request`, Workflow: `Terraform Plan/Apply`*